# Series 和 DataFrame 的简单数学运算

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Create two Series

In [3]:
# create a Series named s1
s1 = Series([1,2,3],index=['A','B','C'])
s1

A    1
B    2
C    3
dtype: int64

In [4]:
# create a Series named s2
s2 = Series([4,5,6,7],index=['B','C','D','E'])
s2

B    4
C    5
D    6
E    7
dtype: int64

## <font color="orange">Addition + : add two Series</font>

- add two values with the same index

- if the index is not in another,the result will be NaN

In [5]:
s1 + s2

A    NaN
B    6.0
C    8.0
D    NaN
E    NaN
dtype: float64

#### create a dataFrame named df1
format:
- 2 X 2
- value from 0 - 3
- row index : A, B
- column name : BJ,SH

In [10]:
# df1 dataframe
df1 = DataFrame(np.arange(4).reshape(2,2),index=['A','B'],columns=['BJ','SH'])
df1

   BJ  SH
A   0   1
B   2   3

#### create a dataFrame named df2

format:
- 3 X 3
- value from 0 - 8
- row index : A, B, C
- column name : BJ,SH,GZ

In [15]:
# df2 dataframe
df2 = DataFrame(np.arange(9).reshape(3,3),index=['A','B','C'],columns=['BJ','SH','GZ'])
df2

   BJ  SH  GZ
A   0   1   2
B   3   4   5
C   6   7   8

In [16]:
# Add two DataFame df1 and df2
df1 + df2

    BJ  GZ   SH
A  0.0 NaN  2.0
B  5.0 NaN  7.0
C  NaN NaN  NaN

## DataFrame Some Methods
- sum()
- min()
- max()
- describe()

### <font color="orange">sum() method</font>

parameters:

- no parameters : calculate values of columns
- axis = 1 : calculate values of *index*

In [19]:
# create a data Frame df3
df3 = DataFrame([[1,2,3],[4,5,np.nan],[7,8,9]],index=['A','B','C'],columns=['c1','c2','c3'])
df3

   c1  c2   c3
A   1   2  3.0
B   4   5  NaN
C   7   8  9.0

In [20]:
# no parameters
df3.sum()

c1    12.0
c2    15.0
c3    12.0
dtype: float64

In [23]:
# axis = 1
df3.sum(axis=1)

A     6.0
B     9.0
C    24.0
dtype: float64

## <font color="orange">min() method</font>

parameters:

- no parameters : find the min value of columns

- axis = 1 : find the min value of index

In [24]:
# print DataFrame df3
df3

   c1  c2   c3
A   1   2  3.0
B   4   5  NaN
C   7   8  9.0

In [25]:
# min()
df3.min()

c1    1.0
c2    2.0
c3    3.0
dtype: float64

In [26]:
# min(axis=1)
df3.min(axis=1)

A    1.0
B    4.0
C    7.0
dtype: float64

## <font color="orange">max() method</font>
parameters:

- no parameters : find the max value of columns

- axis = 1 : find the max value of index

In [30]:
# print df3
df3

   c1  c2   c3
A   1   2  3.0
B   4   5  NaN
C   7   8  9.0

In [28]:
# max()
df3.max()

c1    7.0
c2    8.0
c3    9.0
dtype: float64

In [29]:
# max(axis=1)
df3.max(axis=1)

A    3.0
B    5.0
C    9.0
dtype: float64

## <font color="orange">describe() method </font>

- return the statistical datas via columns

In [32]:
# print df3
df3

   c1  c2   c3
A   1   2  3.0
B   4   5  NaN
C   7   8  9.0

In [33]:
# call describe() method
df3.describe()

        c1   c2        c3
count  3.0  3.0  2.000000
mean   4.0  5.0  6.000000
std    3.0  3.0  4.242641
min    1.0  2.0  3.000000
25%    2.5  3.5  4.500000
50%    4.0  5.0  6.000000
75%    5.5  6.5  7.500000
max    7.0  8.0  9.000000